       FD  VIP-COMPRA
           LABEL RECORD IS STANDARD.
       01  REG-COMPRA.
           03 COMPRA-CHAVE.
              05 COMPRA-CD          PIC 9(04).
           03 COMPRA-NM-FOR         PIC X(60).
           03 COMPRA-PROD-NM        PIC X(20).
           03 COMPRA-PROD-CD        PIC 9(02).
           03 COMPRA-QT             PIC 9(05).
           03 COMPRA-VALOR-UNI      PIC 9(10).
           03 COMPRA-VALOR-TOT      PIC 9(15).